RetroBSD/retrobsd-early/sys/pic32/usb_boot.c
/*
 * Boot code.
 */
asm ("          .section .startup,\"ax\",@progbits");
asm ("          .globl _start");
asm ("          .type _start, function");
asm ("_start:   la      $sp, _estack");
asm ("          la      $ra, main");
asm ("          la      $gp, _gp");
asm ("          jr      $ra");
asm ("          .text");

static inline void button_init()
{
#if defined (UBW32)
    TRISESET = 1 << 7;

#elif defined (MAXIMITE)
    TRISCSET = 1 << 13;

#elif defined (DIP)
    TRISGSET = 1 << 6;
#else
#error "Unknown board"
#endif
}

static inline int button_pressed()
{
#if defined (UBW32)
    return ! (PORTE & (1 << 7));

#elif defined (MAXIMITE)
    return ! (PORTC & (1 << 13));

#elif defined (DIP)
    return ! (PORTG & (1 << 6));
#else
#error "Unknown board"
#endif
}

static inline void led_init()
{
#if defined (UBW32)
    LATECLR = 0xF;
    TRISECLR = 0xF;

#elif defined (MAXIMITE)
    LATECLR = 2;
    TRISECLR = 2;
    LATFCLR = 1;
    TRISFCLR = 1;

#elif defined (DIP)
    LATECLR = 0xF0;
    TRISECLR = 0xF0;
#else
#error "Unknown board"
#endif
}

static inline void led_toggle (int n)
{
#if defined (UBW32)
    PORTEINV = 1 << n;

#elif defined (MAXIMITE)
    PORTEINV = 1 << 1;

#elif defined (DIP)
    PORTEINV = 0x10 << n;
#else
#error "Unknown board"
#endif
}

#if 1
static inline void cinit()
{
    /*
     * Setup UART registers.
     * Compute the divisor for 115.2 kbaud.
     * Assume we have 80 MHz cpu clock.
     */
    U1BRG = PIC32_BRG_BAUD (CPU_KHZ * 1000, 115200);
    U1STA = 0;
    U1MODE = PIC32_UMODE_PDSEL_8NPAR |	/* 8-bit data, no parity */
             PIC32_UMODE_ON;		/* UART Enable */
    U1STASET = PIC32_USTA_URXEN |		/* Receiver Enable */
               PIC32_USTA_UTXEN;		/* Transmit Enable */

}

/*
 * Send a byte to the UART transmitter, with interrupts disabled.
 */
static void cputc (int c)
{
    /* Wait for transmitter shift register empty. */
    while (! (U1STA & PIC32_USTA_TRMT))
        continue;
again:
    /* Send byte. */
    U1TXREG = c;

    /* Wait for transmitter shift register empty. */
    while (! (U1STA & PIC32_USTA_TRMT))
        continue;

    if (c == '\n') {
        c = '\r';
        goto again;
    }
}

static void cputs (const char *p)
{
    for (; *p; ++p)
        cputc (*p);
}
#endif

/*
 * Reset the microrontroller.
 */
static void soft_reset()
{
    mips_intr_disable();

    if (! (DMACON & 0x1000)) {
        DMACONSET = 0x1000;
        while (DMACON & 0x800)
            continue;
    }
    SYSKEY = 0;
    SYSKEY = 0xaa996655;
    SYSKEY = 0x556699aa;

    RSWRSTSET = 1;
    (void) RSWRST;

    for (;;)
        continue;
}

/*
 * Microsecond delay routine for MIPS processor.
 */
static void udelay (unsigned usec)
{
    unsigned now = mips_read_c0_register (C0_COUNT, 0);
    unsigned final = now + usec * (CPU_KHZ / 1000);

    for (;;) {
        now = mips_read_c0_register (C0_COUNT, 0);

        /* This comparison is valid only when using a signed type. */
        if ((int) (now - final) >= 0)
            break;
    }
}

/*
 * BlinkUSBStatus turns on and off LEDs
 * corresponding to the USB device state.
 */
static void led_blink()
{
    static unsigned led_count;

    if (led_count == 0)
        led_count = 100;
    led_count--;

    if (//! usb_is_device_suspended() &&
//      usb_device_state == CONFIGURED_STATE &&
        led_count == 0)
    {
cputc('.');
        led_toggle(3);
    }
}

/*
 * Perform non-volatile memory operation.
 */
static void nvm_operation (unsigned op, unsigned address, unsigned data)
{
    int x;

    // Convert virtual address to physical
    NVMADDR = address & 0x1fffffff;
    NVMDATA = data;

    // Disable interrupts
    x = mips_intr_disable();

    // Enable Flash Write/Erase Operations
    NVMCON = PIC32_NVMCON_WREN | op;

    // Data sheet prescribes 6us delay for LVD to become stable.
    // To be on the safer side, we shall set 7us delay.
    udelay (7);

    NVMKEY = 0xAA996655;
    NVMKEY = 0x556699AA;
    NVMCONSET = PIC32_NVMCON_WR;

    // Wait for WR bit to clear
    while (NVMCON & PIC32_NVMCON_WR)
        continue;

    // Disable Flash Write/Erase operations
    NVMCONCLR = PIC32_NVMCON_WREN;

    // Enable interrupts
    mips_intr_restore (x);
#if 0
    // Check error status
    if (NVMCON & (PIC32_NVMCON_WRERR | PIC32_NVMCON_LVDERR)) {
        TODO;
    }
#endif
}

/*
 * Use word writes to write code chunks less than a full 64 byte block size.
 */
static void write_flash_block()
{
    unsigned int i;

    for (i = 0; buf_index > 0; buf_index--) {
        // Write word to flash memory.
        nvm_operation (PIC32_NVMCON_WORD_PGM,
            base_address - buf_index * sizeof(unsigned),
            buf [i++]);
    }
}

/*
 * A command packet was received from PC.
 * Process it and send a reply.
 * In_handle should be free before calling this function.
 */
static void handle_packet()
{
    int i;

    switch (receive.Command) {
    case QUERY_DEVICE:
        // Prepare a response packet, which lets the PC software know
        // about the memory ranges of this device.

        send.Command = QUERY_DEVICE;
        send.PacketDataFieldSize = REQUEST_SIZE;
        send.DeviceFamily = 3;            /* PIC23 */

        send.Type1 = 1;                   /* program memory type */
        send.Address1 = FLASH_PROGRAM;
        send.Length1 = FLASH_START + BMXPFMSZ - FLASH_PROGRAM;

        send.Type2 = 0xFF;                /* end of list */

        in_handle = usb_transfer_one_packet (HID_EP, IN_TO_HOST,
            (unsigned char*) &send, PACKET_SIZE);
        break;

    case UNLOCK_CONFIG:
        break;

    case ERASE_DEVICE:
        for (i = 0; i < BMXPFMSZ/BYTES_PER_PAGE; i++) {
            /* Erase flash page */
            nvm_operation (PIC32_NVMCON_PAGE_ERASE,
                FLASH_PROGRAM + i * BYTES_PER_PAGE, 0);

            // Call this function periodically to prevent falling
            // off the bus if any SETUP packets should happen to arrive.
            usb_device_tasks();
        }
        // Good practice to clear WREN bit anytime we are
        // not expecting to do erase/write operations,
        // further reducing probability of accidental activation.
        NVMCONCLR = PIC32_NVMCON_WREN;
        break;

    case PROGRAM_DEVICE:
        if (base_address == 0)
            base_address = receive.Address;

        if (base_address == receive.Address) {
            for(i = 0; i < receive.Size/sizeof(unsigned); i++) {
                unsigned int index;

                index = (REQUEST_SIZE - receive.Size) / sizeof(unsigned) + i;

                // Data field is right justified.
                // Need to put it in the buffer left justified.
                buf [buf_index++] =
                    receive.Data [(REQUEST_SIZE - receive.Size) / sizeof(unsigned) + i];
                base_address += sizeof(unsigned);
                if (buf_index == REQUEST_SIZE / sizeof(unsigned)) {
                    write_flash_block();
                }
            }
        }
        // else host sent us a non-contiguous packet address...
        // to make this firmware simpler, host should not do this without
        // sending a PROGRAM_COMPLETE command in between program sections.
        break;

