RetroBSD/retrobsd-early/sys/pic32/usb_boot.c
    case PROGRAM_COMPLETE:
        write_flash_block();

        // Reinitialize pointer to an invalid range, so we know the next
        // PROGRAM_DEVICE will be the start address of a contiguous section.
        base_address = 0;
        break;

    case GET_DATA:
        send.Command = GET_DATA;
        send.Address = receive.Address;
        send.Size = receive.Size;

        for (i = 0; i < (receive.Size/sizeof(unsigned)); i++) {
            unsigned *p;
            unsigned data;

            p = ((unsigned*) ((receive.Address + (i * sizeof(unsigned))) | 0x80000000));
            data = *p;

            send.Data [REQUEST_SIZE/sizeof(unsigned) + i -
                receive.Size/sizeof(unsigned)] =
                *((unsigned*)((receive.Address + (i * sizeof(unsigned))) | 0x80000000));
        }

        in_handle = usb_transfer_one_packet (HID_EP,  IN_TO_HOST,
            (unsigned char*) &send.Contents[0], PACKET_SIZE);
        break;

    case RESET_DEVICE:
        // Disable USB module
        U1CON = 0x0000;

        // And wait awhile for the USB cable capacitance to discharge
        // down to disconnected (SE0) state.   Otherwise host might not
        // realize we disconnected/reconnected when we do the reset.
        udelay (1000);

        soft_reset();
        break;
    }
}

/*
 * Main program entry point.
 */
int main()
{
    /* Initialize STATUS register: master interrupt disable. */
    mips_write_c0_register (C0_STATUS, 0, ST_CU0 | ST_BEV);

    /* Clear CAUSE register: use special interrupt vector 0x200. */
    mips_write_c0_register (C0_CAUSE, 0, CA_IV);

    /*
     * Setup wait states.
     */
    CHECON = 2;
    BMXCONCLR = 0x40;
    CHECONSET = 0x30;

    /* Disable JTAG port, to use it for i/o. */
    DDPCON = 0;

    /* Config register: enable kseg0 caching. */
    mips_write_c0_register (C0_CONFIG, 0,
        mips_read_c0_register (C0_CONFIG, 0) | 3);

    /* Initialize all .bss variables by zeros. */
    extern unsigned __bss_start, __bss_end;
    unsigned *dest = &__bss_start;
    while (dest < &__bss_end)
            *dest++ = 0;

cinit();
cputs("=0=\n");

    // Initialize all of the LED pins
    led_init();

    // Initialize all of the push buttons
    button_init();

    /*
     * To call the normal application (i.e. don't go into the bootloader)
     * we need to make sure that the PRG button is not pressed, and that we
     * don't have a software reset.
     */
    if (! button_pressed() &&
        (! (RCON & PIC32_RCON_SWR) || reset_key != 0x12345678))
    {
        // Must clear out software key
	reset_key = 0;

        // If there is NO real program to execute, then fall through to the bootloader
	if (*(int*) FLASH_BOOT != 0xFFFFFFFF)	{
            void (*fptr)(void) = (void (*)(void)) FLASH_BOOT;

            fptr();
            for (;;)
                continue;
	}
    }
    // Must clear out software key.
    reset_key = 0;
    RCONCLR = PIC32_RCON_SWR;
cputs("=1=\n");

    // Initialize USB module SFRs and firmware variables to known states.
    usb_device_init();
cputs("=2=\n");

in_handle = 0;
    for (;;) {
	// Check bus status and service USB interrupts.
        usb_device_tasks();
//cputs("=3=\n");

        // Blink the LEDs according to the USB device status
        led_blink();

        // User Application USB tasks
        if (usb_device_state < CONFIGURED_STATE /*|| usb_is_device_suspended()*/)
            continue;
cputs("=4=\n");

        // Are we done sending the last response.  We need to be before we
        // receive the next command because we clear the send buffer
        // once we receive a command
        if (in_handle && usb_handle_busy (in_handle))
            continue;

        if (packet_received) {
cputs("=5=\n");
            handle_packet();
            packet_received = 0;
            continue;
        }
cputs("=6=\n");

        // Did we receive a command?
        if (usb_handle_busy (out_handle))
            continue;
cputs("=7=\n");

        // Make a copy of received data.
        int i;
        for (i = 0; i < PACKET_SIZE; i++) {
            receive.Contents[i] = receive_buffer.Contents[i];
        }

        // Restart receiver, to be ready for a next packet.
        out_handle = usb_transfer_one_packet (HID_EP, OUT_FROM_HOST,
            (unsigned char*) &receive_buffer, PACKET_SIZE);

        // Prepare the next packet we will send to the host,
        // by initializing the entire packet to 0x00.
        for (i = 0; i < PACKET_SIZE; i++) {
            send.Contents[i] = 0;
        }
        packet_received = 1;
cputs("=8=\n");
    }
}

/*
 * USB Callback Functions
 */
/*
 * Call back that is invoked when a USB suspend is detected.
 */
void usbcb_suspend()
{
    /* Empty. */
}

/*
 * This call back is invoked when a wakeup from USB suspend is detected.
 */
void usbcb_wake_from_suspend()
{
    /* Empty. */
}

/*
 * Called when start-of-frame packet arrives, every 1 ms.
 */
void usbcb_sof_handler()
{
    /* Empty. */
}

/*
 * Called on any USB error interrupt, for debugging purposes.
 */
void usbcb_error_handler()
{
    /* Empty. */
}

/*
 * Process device-specific SETUP requests.
 */
void usbcb_check_other_req()
{
    hid_check_request();
}

/*
 * Handle a SETUP SET_DESCRIPTOR request (optional).
 */
void usbcb_std_set_dsc_handler()
{
    /* Empty. */
}

/*
 * This function is called when the device becomes initialized.
 * It should initialize the endpoints for the device's usage
 * according to the current configuration.
 */
void usbcb_init_ep()
{
    // Enable the HID endpoint
    usb_enable_endpoint (HID_EP, USB_IN_ENABLED | USB_OUT_ENABLED |
        USB_HANDSHAKE_ENABLED | USB_DISALLOW_SETUP);

    // Arm the OUT endpoint for the first packet
    out_handle = usb_rx_one_packet (HID_EP,
        &receive_buffer.Contents[0], PACKET_SIZE);
}

/*
 * The device descriptor.
 */
const USB_DEVICE_DESCRIPTOR usb_device = {
    sizeof (usb_device),    // Size of this descriptor in bytes
    USB_DESCRIPTOR_DEVICE,  // DEVICE descriptor type
    0x0200,                 // USB Spec Release Number in BCD format
    0x00,                   // Class Code
    0x00,                   // Subclass code
    0x00,                   // Protocol code
    USB_EP0_BUFF_SIZE,      // Max packet size for EP0
    0x04D8,                 // Vendor ID
    0x003C,                 // Product ID: USB HID Bootloader
    0x0002,                 // Device release number in BCD format
    1,                      // Manufacturer string index
    2,                      // Product string index
    0,                      // Device serial number string index
    1,                      // Number of possible configurations
};

